; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-8nodes-1000size-3degree-100mindistance-2trucks-3packages-758seed

(define (problem transport-city-sequential-8nodes-1000size-3degree-100mindistance-2trucks-3packages-758seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  city-loc-6 - location
  city-loc-7 - location
  city-loc-8 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 543,839 -> 833,827
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 29)
  ; 833,827 -> 543,839
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 29)
  ; 696,259 -> 339,64
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 41)
  ; 339,64 -> 696,259
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 41)
  ; 981,509 -> 833,827
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 36)
  ; 833,827 -> 981,509
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 36)
  ; 981,509 -> 696,259
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 38)
  ; 696,259 -> 981,509
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 38)
  ; 685,547 -> 833,827
  (road city-loc-6 city-loc-2)
  (= (road-length city-loc-6 city-loc-2) 32)
  ; 833,827 -> 685,547
  (road city-loc-2 city-loc-6)
  (= (road-length city-loc-2 city-loc-6) 32)
  ; 685,547 -> 543,839
  (road city-loc-6 city-loc-3)
  (= (road-length city-loc-6 city-loc-3) 33)
  ; 543,839 -> 685,547
  (road city-loc-3 city-loc-6)
  (= (road-length city-loc-3 city-loc-6) 33)
  ; 685,547 -> 696,259
  (road city-loc-6 city-loc-4)
  (= (road-length city-loc-6 city-loc-4) 29)
  ; 696,259 -> 685,547
  (road city-loc-4 city-loc-6)
  (= (road-length city-loc-4 city-loc-6) 29)
  ; 685,547 -> 981,509
  (road city-loc-6 city-loc-5)
  (= (road-length city-loc-6 city-loc-5) 30)
  ; 981,509 -> 685,547
  (road city-loc-5 city-loc-6)
  (= (road-length city-loc-5 city-loc-6) 30)
  ; 422,758 -> 543,839
  (road city-loc-7 city-loc-3)
  (= (road-length city-loc-7 city-loc-3) 15)
  ; 543,839 -> 422,758
  (road city-loc-3 city-loc-7)
  (= (road-length city-loc-3 city-loc-7) 15)
  ; 422,758 -> 685,547
  (road city-loc-7 city-loc-6)
  (= (road-length city-loc-7 city-loc-6) 34)
  ; 685,547 -> 422,758
  (road city-loc-6 city-loc-7)
  (= (road-length city-loc-6 city-loc-7) 34)
  ; 743,7 -> 339,64
  (road city-loc-8 city-loc-1)
  (= (road-length city-loc-8 city-loc-1) 41)
  ; 339,64 -> 743,7
  (road city-loc-1 city-loc-8)
  (= (road-length city-loc-1 city-loc-8) 41)
  ; 743,7 -> 696,259
  (road city-loc-8 city-loc-4)
  (= (road-length city-loc-8 city-loc-4) 26)
  ; 696,259 -> 743,7
  (road city-loc-4 city-loc-8)
  (= (road-length city-loc-4 city-loc-8) 26)
  (at package-1 city-loc-7)
  (at package-2 city-loc-8)
  (at package-3 city-loc-4)
  (at truck-1 city-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-loc-3)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-loc-2)
  (at package-2 city-loc-3)
  (at package-3 city-loc-8)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-loc-3 city-loc-6)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-6)
   goals met: 0 of 3
2. (drive truck-1 city-loc-6 city-loc-4)
   deleted: (at truck-1 city-loc-6)
   added: (at truck-1 city-loc-4)
   goals met: 0 of 3
3. (pick-up truck-1 city-loc-4 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-loc-4) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 3
4. (drive truck-1 city-loc-4 city-loc-8)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-8)
   goals met: 0 of 3
5. (pick-up truck-1 city-loc-8 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-loc-8) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 3
6. (drop truck-1 city-loc-8 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-loc-8) (capacity truck-1 capacity-2)
   goals met: 1 of 3
7. (drive truck-1 city-loc-8 city-loc-4)
   deleted: (at truck-1 city-loc-8)
   added: (at truck-1 city-loc-4)
   goals met: 1 of 3
8. (drive truck-1 city-loc-4 city-loc-6)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-6)
   goals met: 1 of 3
9. (drive truck-1 city-loc-6 city-loc-7)
   deleted: (at truck-1 city-loc-6)
   added: (at truck-1 city-loc-7)
   goals met: 1 of 3
10. (pick-up truck-1 city-loc-7 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-loc-7) (capacity truck-1 capacity-2)
   added: (in package-1 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 3
11. (drive truck-1 city-loc-7 city-loc-3)
   deleted: (at truck-1 city-loc-7)
   added: (at truck-1 city-loc-3)
   goals met: 1 of 3
12. (drop truck-1 city-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-loc-3) (capacity truck-1 capacity-2)
   goals met: 2 of 3
13. (drive truck-1 city-loc-3 city-loc-2)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-2)
   goals met: 2 of 3
14. (drop truck-1 city-loc-2 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-loc-2) (capacity truck-1 capacity-3)
   goals met: 3 of 3
